/*******************************************************************************
* capt_hal_inter.h
*
* HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
*
* Author : wangweiqin <wangweiqin@hikvision.com.cn>
* Version: V1.0.0  2017年09月08日 Create
*
* Description : 硬件平台采集模块
* Modification:
*******************************************************************************/

#ifndef _CAPT_HAL_INTER_H_
#define _CAPT_HAL_INTER_H_

/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */
#include "sal.h"
#include <sys/ioctl.h>

/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */
#define CAPT_ALLOC_MEM_NUM  (4)


/*****************************************************************************
                            结构体定义
*****************************************************************************/


typedef struct _CAPT_PLAT_OPS
{
    /*******************************************************************************
    * 函数名  : 获取pipeID
    * 描  述  : 初始化采集接口MIPI、LVDS控制器
    * 输  入  : - uiDev   设备号
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*GetCaptPipeId)(UINT32 u32ChnId, INT32 *pPipeId);

     /*******************************************************************************
     * 函数名  : initCaptInterface
     * 描  述  : 初始化采集接口MIPI、LVDS控制器
     * 输  入  : - uiDev   设备号
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *         : 失败:SAL_FAIL
     *******************************************************************************/
     INT32 (*initCaptInterface)(UINT32 uiDev);

     /*******************************************************************************
     * 函数名  : initCaptInterface
     * 描  述  : 初始化采集接口MIPI、LVDS控制器
     * 输  入  : - uiDev   设备号
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *         : 失败:SAL_FAIL
     *******************************************************************************/
     INT32 (*reSetCaptInterface)(UINT32 uiChn,UINT32 width, UINT32 height, UINT32 fps);

    /*******************************************************************************
    * 函数名  : createCaptDev
    * 描  述  : 创建vi输入设备
    * 输  入  : - pDispDev   设备信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*initCaptDev)(UINT32 uiDev, CAPT_CHN_ATTR *pstChnAttr);

    /*******************************************************************************
    * 函数名  : deInitCaptDev
    * 描  述  : 去初始化vi输入设备
    * 输  入  : - pDispDev   设备信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*deInitCaptDev)(UINT32 uiDev);

    /*******************************************************************************
    * 函数名  : startCaptChn
    * 描  述  : 开启采集通道
    * 输  入  : - uiDev   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*startCaptDev)(UINT32 uiDev);

    /*******************************************************************************
    * 函数名  : stopCaptChn
    * 描  述  : 停止采集通道
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*stopCaptDev)(UINT32 uiDev);

    /*******************************************************************************
    * 函数名  : stopCaptChn
    * 描  述  : 设置采集通道参数
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*setCaptChnAttr)(UINT32 uiDev);

    /*******************************************************************************
    * 函数名  : getCaptChnState
    * 描  述  : 获取采集通道状态
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*getCaptDevState)(UINT32 uiDev, CAPT_HAL_CHN_STATUS *pstStatus);

    /*******************************************************************************
    * 函数名  : setCaptChnRotate
    * 描  述  : 设置采集通道旋转属性
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*setCaptChnRotate)(UINT32 uiDev, UINT32 uiChn ,CAPT_ROTATION rotation);

    /*******************************************************************************
    * 函数名  : enableCaptUserPic
    * 描  述  : 使能采集模块使用用户图片，用于无信号时编码
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*enableCaptUserPic)(UINT32 uiDev, UINT32 uiEnble);

    /*******************************************************************************
    * 函数名  : enableCaptUserPic
    * 描  述  : 使能采集模块使用用户图片，用于无信号时编码
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*setCaptUserPic)(UINT32 uiDev, CAPT_CHN_USER_PIC *pstUserPic);

    /*******************************************************************************
    * 函数名  : enableCaptUserPic
    * 描  述  : 使能采集模块使用用户图片，用于无信号时编码
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 状态:0  
    *         :   :1
    *******************************************************************************/
    UINT32 (*getCaptUserPicStatus)(UINT32 uiDev);

    /*******************************************************************************
    * 函数名  : checkCaptIsOffset
    * 描  述  : 使能采集模块使用用户图片，用于无信号时编码
    * 输  入  : - uiChn   通道信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    BOOL (*checkCaptIsOffset)(UINT32 uiDev);

    /*******************************************************************************
    * 函数名  : getCaptFrame
    * 描  述  : 获取一帧图像，与realseCaptFrame一起使用
    * 输  入  : - uiChn   通道信息
              - UINT32 u32TimeoutMs     超时时间
    * 输  出  : - SYSTEM_FRAME_INFO *pstFrame     帧数据
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*getCaptFrame)(UINT32 uiDev, SYSTEM_FRAME_INFO *pstFrame, UINT32 u32TimeoutMs);

    /*******************************************************************************
    * 函数名  : realseCaptFrame
    * 描  述  : 释放一帧图像,与getCaptFrame一起使用
    * 输  入  : - uiChn   通道信息
              - SYSTEM_FRAME_INFO *pstFrame     帧数据
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*realseCaptFrame)(UINT32 uiDev, SYSTEM_FRAME_INFO *pstFrame);

}CAPT_PLAT_OPS;


/*******************************************************************************
* 函数名  : capt_halRegister
* 描  述  : 注册hisi disp显示函数
* 输  入  : - prm:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
CAPT_PLAT_OPS *capt_halRegister(void);


#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif

