/**
 * @file   mem_hal_inter.h
 * @note   2010-2020, Hikvision Digital Technology Co., Ltd.
 * @brief
 * @author
 * @date
 * @note
 * @note \n History
   1.Date        :
     Author      :
     Modification:
 */
#ifndef _MEM_HAL_INTER_H_

#define _MEM_HAL_INTER_H_

#include "sal.h"

//#include "platform_sdk.h"
#include "platform_hal.h"






typedef struct _DISP_PLAT_OPS
{
  /*******************************************************************************
    * 函数名  : modInit
    * 描  述  : 模块初始化
    * 输  入  : - prm
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*modInit)(VOID *prm);

    /*******************************************************************************
    * 函数名  : createVoDev
    * 描  述  : 创建vo显示设备
    * 输  入  : - pDispDev   设备信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*createVoDev)(DISP_DEV_COMMON *pDispDev);

    /*******************************************************************************
    * 函数名  : deleteVoDev
    * 描  述  : 销毁vo显示设备
    * 输  入  : - prm   显示设备信息
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/    
    INT32 (*deleteVoDev)(VOID *prm);

    /*******************************************************************************
    * 函数名  : Disp_hisiCreateLayer
    * 描  述  : 创建视频层
    * 输  入  : - prm:
    * 输  出  : 无
    * 返回值  : SAL_SOK  : 成功
    *           SAL_FAIL : 失败
    *******************************************************************************/
    INT32 (*createVoLayer)(VOID *prm);

    /*******************************************************************************
    * 函数名  : setVoChnParam
    * 描  述  : 设置VO显示通道参数
    * 输  入  : - prm    通道参数
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*setVoChnParam)(VOID *prm);

    /*******************************************************************************
    * 函数名  : setVoLayerCsc
    * 描  述  : 设置视频层图像输出效果
    * 输  入  : - uiChn:
    *         : - Lua  :
    *         : - Con  :
    *         : - Hue  :
    *         : - Sat  :
    * 输  出  : 无
    * 返回值  : SAL_SOK  : 成功
    *           SAL_FAIL : 失败
    *******************************************************************************/
    INT32 (*setVoLayerCsc)(UINT32 uiVoLayer, void *prm);


    /*******************************************************************************
    * 函数名  : enableVoChn
    * 描  述  : 使能VO显示通道
    * 输  入  : - prm    通道参数
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*enableVoChn)(VOID *prm);

    /*******************************************************************************
    * 函数名  : clearVoChnBuf
    * 描  述  : 清空指定输出通道的缓存 buffer 数据
    * 输  入  : - uiLayerNo: Vo设备号
    *         : - uiVoChn  : Vo通道号
              : - bFlag    : 选择模式
    * 输  出  : 无
    * 返回值  : SAL_SOK  : 成功
    *           SAL_FAIL : 失败
    *******************************************************************************/
    INT32 (*clearVoChnBuf)(UINT32 uiVoLayer, UINT32 uiVoChn, UINT32 bFlag);

     /*******************************************************************************
    * 函数名  : disableVoChn
    * 描  述  : 禁止VO显示通道
    * 输  入  : - prm    通道参数
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*disableVoChn)(VOID *prm);

    /*******************************************************************************
    * 函数名  : startVoChn
    * 描  述  : 
    * 输  入  : - prm    通道参数
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*startVoChn)(VOID *prm);

    /*******************************************************************************
    * 函数名  : stopVoChn
    * 描  述  : 
    * 输  入  : - prm    通道参数
    * 输  出  : -无
    * 返回值  : 成功:SAL_SOK
    *         : 失败:SAL_FAIL
    *******************************************************************************/
    INT32 (*stopVoChn)(VOID *prm);

     /*******************************************************************************
     * 函数名  : deinitVoStartingup
     * 描  述  : VO设备反初始化
     * 输  入  : - uiDev   VO设备号
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *         : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*deinitVoStartingup)(UINT32 uiDev);

     /*******************************************************************************
     * 函数名  : sendFrameVoChn
     * 描  述  : 填充帧信息
     * 输  入  : - videoFrame    通道参数
     *       ：- pFrame 帧数据
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *         : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*putVoFrameInfo)(SAL_VideoFrameBuf *videoFrame, VOID *pFrame); 

     /*******************************************************************************
     * 函数名  : sendFrameVoChn
     * 描  述  : 送一帧数据到VO通道
     * 输  入  : - prm    通道参数
     *       ：- pFrame 帧数据
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *         : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*sendVoChnFrame)(VOID *prm, VOID *pFrame, INT32 s32MilliSec); 

    INT32 (*pullOutFrame)(VOID *prm, VOID *pFrame, INT32 s32MilliSec);

     /*******************************************************************************
    * 函数名  : getVoChnFrame
    * 描  述  : 获取vo输出帧数据
    * 输  入  : - pDispChn:
    *         : - Ctrl    :
    * 输  出  : 无
    * 返回值  : SAL_SOK  : 成功
    *           SAL_FAIL : 失败
    *******************************************************************************/
    INT32 (*getVoChnFrame)(UINT32 VoLayer, UINT32 VoChn, SYSTEM_FRAME_INFO *pstFrame);

    /*******************************************************************************
     * 函数名  : setVoInterface
     * 描  述  : 设置VO输出接口
     * 输  入  : - pDispDev  VO设备
     *       ：- pstTiming VO接口时序参数
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *       : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*setVoInterface)(DISP_DEV_COMMON *pDispDev);

    /*******************************************************************************
     * 函数名  : getHdmiEdid
     * 描  述  : 获取显示hdmi edid信息
     * 输  入  : - u32HdmiId  hdmi id
     *       ：- pu8Buff edid信息
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *       : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*getHdmiEdid)(UINT32 u32HdmiId, UINT8 *pu8Buff, UINT32 *pu32Len);

    /*******************************************************************************
     * 函数名  : setVoChnPriority
     * 描  述  : 获取显示优先级
     * 输  入  : - u32HdmiId  hdmi id
     *       ：- pu8Buff edid信息
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *       : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*setVoChnPriority)(VOID *prm);
   
    /*******************************************************************************
    * 函数名  : getDispWbc
    * 描  述  : 视频层回写使能操作
    * 输  入  : VoLayer  *pstVFrame
    *         :
    * 输  出  :
    * 返回值  : RK_SUCCESS  : 成功
    *           : 失败
    *******************************************************************************/
    INT32 (*getDispWbc)(UINT32 VoLayer,VO_FRAME_INFO_ST *pstVFrame);
    
    /*******************************************************************************
    * 函数名  : enableDispWbc
    * 描  述  : 视频层回写操作
    * 输  入  : VoWbc
    *         :
    * 输  出  : pstVFrame
    * 返回值  : RK_SUCCESS  : 成功
    *           : 失败
    *******************************************************************************/
    INT32 (*enableDispWbc)(UINT32 VoWbc,unsigned int *pParam);

     /*******************************************************************************
     * 函数名  : setVoCommonPrm
     * 描  述  : 设置通用显示参数
     * 输  入  : - enType
     *       ：   - prm   参数信息(支持自定义参数)
     * 输  出  : -无
     * 返回值  : 成功:SAL_SOK
     *       : 失败:SAL_FAIL
     *******************************************************************************/
    INT32 (*setVoCommonPrm)(DISP_CFG_TYPE_E enType, VOID *prm);

} DISP_PLAT_OPS;

/*******************************************************************************
* 函数名  : disp_halRegister
* 描  述  : 注册hisi disp显示函数
* 输  入  : - prm:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
DISP_PLAT_OPS *disp_halRegister(void);



#endif /* _MEM_HAL_INTER_H_ */


