/*******************************************************************************
* svp_dsp_hal_inter.h
*
* HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
*
* Author : liuxianying<liuxianying@hikvision.com>
* Version: V1.0.0  2021年07月20日 Create
*
* Description :
* Modification:
*******************************************************************************/

#ifndef __SVP_DSP_HAL_INTER_H_
#define __SVP_DSP_HAL_INTER_H_

#include "sal.h"

#define SVP_DSP_CORE_NUM_MAX (4)


typedef struct _SVP_DSP_PLAT_OPS
{


    /*******************************************************************************
    * 函数名  : init
    * 描  述  : DSP核初始化
    * 输  入  : 
    * 输  出  : 
    * 返回值  : SAL_SOK        : 成功
    *         -SAL_FAIL      : 失败
    *******************************************************************************/
    INT32 (*init)(UINT32 u32CoreNum, UINT32 *pu32Core);

    /*******************************************************************************
    * 函数名  : getStatus
    * 描  述  : 查询对应核的任务是否完成
    * 输  入  : UINT32 u32CoreId
    * 输  出  : BOOL *pbFinish
    * 返回值  : SAL_SOK        : 成功
    *         -SAL_FAIL      : 失败
    *******************************************************************************/
    INT32 (*getStatus)(UINT32 u32CoreId, BOOL *pbFinish);

    /*******************************************************************************
    * 函数名  : setTask
    * 描  述  : 调用DSP核处理指定任务
    * 输  入  : UINT32 u32CoreId
              UINT32 enCmd
              UINT64 u64PhyAddr
              UINT32 u32Len
    * 输  出  : 
    * 返回值  : SAL_SOK        : 成功
    *         -SAL_FAIL      : 失败
    *******************************************************************************/
    INT32 (*setTask)(UINT32 u32CoreId, UINT32 enCmd, UINT64 u64PhyAddr, UINT32 u32Len);

    /*******************************************************************************
    * 函数名  : svpdsp_hisiGetCoreNum
    * 描  述  : 获取可使用核的数目
    * 输  入  : 
    * 输  出  : 
    * 返回值  : svp dsp核心数
    *******************************************************************************/
    INT32 (*getCoreNum)(void);

    /*******************************************************************************
    * 函数名  : Unload dsp_bin files
    * 描  述  : 去加载dsp_bin文件
    * 输  入  : 
    * 输  出  : 
    * 返回值  : svp dsp核心数
    *******************************************************************************/
    INT32 (*unloadDspbin)(UINT32 dspCoreId);

    /*******************************************************************************
    * 函数名  : Load dsp_bin files
    * 描  述  : 去加载dsp_bin文件
    * 输  入  : 
    * 输  出  : 
    * 返回值  : svp dsp核心数
    *******************************************************************************/
    INT32 (*loadDspbin)(UINT32 dspCoreId);

}SVP_DSP_PLAT_OPS;

/*******************************************************************************
* 函数名  : svpdsp_halRegister
* 描  述  : 注册svp dsp函数
* 输  入  : - prm:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
SVP_DSP_PLAT_OPS *svpdsp_halRegister(void);


#endif


