

#ifndef __HARFBUZZ_FUNC_H_
#define __HARFBUZZ_FUNC_H_

#include "sal.h"
#include "hb.h"

/*******************************************************************************
* 函数名  : HB_Init
* 描  述  : HB初始化
* 输  入  : 
* 输  出  : 无
* 返回值  : 0        : 成功
*         -1      : 失败
*******************************************************************************/
INT32 HB_Init(const char *pcfont, UINT32 u32FontLen);
/*******************************************************************************
* 函数名  : HB_PlasticCode
* 描  述  : 字符整性
* 输  入  : 
* 输  出  : 无
* 返回值  : 0        : 成功
*         -1      : 失败
*******************************************************************************/
INT32 HB_PlasticCode(char    *pu8Unicode, UINT32 *pu32CodeNum, hb_glyph_info_t **pstinfos, ENCODING_FORMAT_E enEncFormat);

/*******************************************************************************
* 函数名  : HB_Deinit
* 描  述  : HB反初始化
* 输  入  : 
* 输  出  : 无
* 返回值  : 无
*******************************************************************************/
VOID HB_Deinit();



#endif

