/*******************************************************************************************************************************
** 版权信息：Copyright (c) 2009, 杭州海康威视数字技术股份有限公司
**
** 文件名称：HIK_resample.h
**
** 文件标识：HIKVISION_RESAMPLE_H
**
** 文件摘要：音频重采样函数接口,实现了5种不同精度的重采样算法
**
**
** 当前版本：2.4.0
** 作    者：童仁杰
** 日    期：2019年3月19号
** 备    注: 增加reset接口，并在接口中增加内存剩余的未处理数据
**
** 当前版本：2.3.6
** 作    者：陈扬坤
** 日    期：2017年8月14号
** 备    注: 对Creat代码中计算dtb代码分步计算，避免在3531D-a9-v500出现计算异常
**
** 当前版本：2.3.5
** 作    者：陈扬坤
** 日    期：2017年3月27号
** 备    注: 对算法处理时延问题进行优化，减少算法的处理延迟
**
** 历史版本：2.3
** 作    者：陈扬坤
** 日    期：2011年8月17号
** 备    注: 当前版本对接口进行修改，并对代码进行整理，优化
**
** 历史版本：2.2
** 作    者：沈林杰
** 日    期：2009年3月3号
** 备    注: 当前版本对接口进行重新封装，输入数据和输出数据是固定长度
**
** 历史版本：2.1
** 作    者：黄添喜
** 日    期：2008年4月28号
** 备    注: 当前版本增加了各通道独立重采样的功能,以前的库不能进行2个以上的通道同时进行重采样
**            最多支持64个通道的独立重采样;
**
** 历史版本: 2.0
** 作    者：黄添喜
** 日    期：2007年12月11号
** 备    注：1.当前版对1.0版的线型重采样算法进行了改进,在非整数倍重采样时会获得更好
**             的效果,线性采样在上采样时(即重采样频率比原频率高时,如将8K重采样为16K),
**             可以获得较好效果, 在下采样时(即重采样频率比原频率低时,如将16K重采样为8K)
**             会出现噪音.
**            
**
**           2.增加了四种非线性重采样算法,新算法克服了线性重采样算法在下采样时出现
**            噪音的问题,但是复杂度有所增加
**
** 
** 1.0
** 作    者：黄添喜
** 日    期：2007年11月27号
** 备    注：音频线性重采样接口文件
*******************************************************************************************************************************/
#ifndef _HIK_RESAMPLE_H_
#define _HIK_RESAMPLE_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "datatypedef.h"
#include "mem_tab.h"

/*******************************************************************************************************************************
*文件版本和时间宏声明
*******************************************************************************************************************************/
/* 当前版本号*/
/* 主版本号，接口改动、功能增加、架构变更时递增，最大63 */
#define HIK_RESAMPLE_MAJOR_VERSION          2
/* 子版本号，性能优化、局部结构调整、模块内集成其他库的主版本提升时递增，最大31 */
#define HIK_RESAMPLE_SUB_VERSION            4
/* 修正版本号，修正bug后递增，最大31 */
#define HIK_RESAMPLE_REVISION_VERSION       0
/* 版本日期*/
#define HIK_RESAMPLE_VER_YEAR               19                /* 年                                */
#define HIK_RESAMPLE_VER_MONTH              3                 /* 月                                */
#define HIK_RESAMPLE_VER_DAY                20                /* 日                                */

#define HIK_RESAMPLE_LIB_S_OK				0x00000000		  /* 成功                              */
#define HIK_RESAMPLE_LIB_S_NEED_MORE_DATA   0x00000001        /* 需要更多的数据                    */

/* 状态码, 表示重采样函数输入参数有错误 */
#define HIK_RESAMPLE_LIB_E_SMALL_INBUF		0x80000000	      /* 输入缓存区太小                    */
#define HIK_RESAMPLE_LIB_E_LEVEL		    0x80000001	      /* 重采样Level范围设置错误           */
#define HIK_RESAMPLE_LIB_E_SAMPLERATE       0x80000002        /* Samplerate不能小于0               */                    
#define HIK_RESAMPLE_LIB_E_NULL_BUF         0x80000003        /* 输入或输出缓存区指针为空          */
#define HIK_RESAMPLE_LIB_E_CHANNEL_ID       0x80000004        /* 输入通道ID范围越界 正确值 0- 63   */
#define HIK_RESAMPLE_LIB_E_PARAM_NULL       0x80000005		  /* 参数指针为空                      */
#define HIK_RESAMPLE_LIB_E_PROC_NUM			0x80000006        /* 处理数据长度小于0                 */
#define HIK_RESAMPLE_LIB_E_INVALIDE_HANDLE  0x80000007        /* 无效句柄                          */
#define HIK_RESAMPLE_LIB_E_BUF_ABNORMAL     0x80000008        /* Buf异常                           */

//重采样参数结构体
typedef struct _HIK_RESAMPLE_PARAM_TAG_
{
	U32 level;						                          //样算法选择,可选值为0,1,2,3,4,值越大效果越好,速度越慢
	U32 proc_num;					                          //一次处理的样本数

	U32 src_sample_rate;			                          //原始音频数据的采样率
	U32 dst_sample_rate;			                          //重采样后的音频数据采样率

    U32 in_pcm_buf_size;			                          //输入pcm数据缓存大小，调用HIK_Resample_GetMemSize可得到
	U32 out_pcm_buf_size;			                          //输出pcm数据缓存大小，调用HIK_Resample_GetMemSize可得到

}RESAMPLE_PARAM;

//重采样处理参数结构体
typedef struct _HIK_RESAMPLE_PROC_PARAM_TAG_
{
    S16 *in_pcm_buf;				                          //输入pcm数据缓存指针
    S16 *out_pcm_buf;	                                      //输出pcm数据缓存指针
    U32 output_pcm_size;                                      //重采样后的输出数据样点数，每个样点为short类型
    S32 no_proc_dat_n;                                        //重采样后的未处理数据样点数，每个样点为short类型
}RESAMPLE_PROC_PARAM;

#ifndef _HRESULT_DEFINED_
#define _HRESULT_DEFINED_
	typedef S32 HRESULT32;
#endif

/*******************************************************************************************************************************
* 函数名: HIK_Resample_GetMemSize
*
* 功  能：获取重采样所需的内存大小以及外部输入缓存和输出缓存的大小
*
* 参  数：param    -IO 重采样参数结构指针
*         mem_tab  -O  内存申请表
*
* 返回值：成功：HIK_RESAMPLE_LIB_S_OK
*         失败：其它状态码
*
* 备  注：参数结构中buf_size变量用来表示重采样所需内存大小
*******************************************************************************************************************************/
HRESULT32 HIK_Resample_GetMemSize(RESAMPLE_PARAM *param, MEM_TAB *mem_tab);

/*******************************************************************************************************************************
* 函数名: HIK_Resample_Creat
*
* 功  能：重采样初始化
*
* 参  数：param		-I  重采样参数结构指针
*         mem_tab   -O  内存申请表
*         handle	-O  重采样句柄
*
* 返回值：成功：HIK_RESAMPLE_LIB_S_OK
*         失败：其它状态码
*
* 备  注：
*******************************************************************************************************************************/
HRESULT32 HIK_Resample_Creat(RESAMPLE_PARAM *param, MEM_TAB *mem_tab, void **handle);

/*******************************************************************************************************************************
* 函数名: HIK_Resample_Process
*
* 功  能：重采样处理
*
* 参  数：(in )  handle			-I  重采样句柄
*         (in )  proc_param	    -IO 重采样处理参数指针
*
* 返回值：成功：HIK_RESAMPLE_LIB_S_OK
*         失败：其它状态码
*
* 备  注：
*******************************************************************************************************************************/
HRESULT32 HIK_Resample_Process(void *handle, RESAMPLE_PROC_PARAM *proc_param);


/*******************************************************************************************************************************
* 函数名: HIK_Resample_Reset
*
* 功  能：重采样重置
*
* 参  数：*         handle	-O  重采样句柄
*
* 返回值：成功：HIK_RESAMPLE_LIB_S_OK
*         失败：其它状态码
*
* 备  注：
*******************************************************************************************************************************/
HRESULT32 HIK_Resample_Reset(void *handle);

/*******************************************************************************************************************************
* 功  能：获取当前编码版本信息
*
* 参  数：无
*
* 返回值：返回版本信息
*
* 备  注：版本信息格式为：版本号＋年（7位）＋月（4位）＋日（5位）
*         其中版本号为：主版本号（6位）＋子版本号（5位）＋修正版本号（5位）
*******************************************************************************************************************************/
U32 HIK_Resample_GetVersion();

#ifdef __cplusplus
}
#endif
  
  
#endif