/***********************************************************************************************************************
* 版权信息：版权所有(c) 2017-2027, 杭州海康威视数字技术股份有限公司, 保留所有权利
*
* 文件名称: CRY_lib.h
* 文件标识: HIK_CRY_LIB_H_
* 摘    要: 海康威视智能算法库加密模块接口头文件（DSP集成端）
*
*
* 当前版本: 0.6.0
* 作    者: 黄崇基
* 日    期: 2017-8-9
* 备    注: 初始版本
***********************************************************************************************************************/

#ifndef _HIK_CRY_LIB_H_
#define _HIK_CRY_LIB_H_

#ifdef __cplusplus
extern "C" {
#endif

/***********************************************************************************************************************
* 功  能: 获取密文，外部获取密文后将密文送给AES解密模块进行解密
* 参  数: cipher_32byte  - O  密文，长度为32字节，地址外部分配
*         serial_num     - I  序列号, 根据应用/行业划分，默认填0
*         
* 返回值: 成功返回1，失败返回-1
* 备  注: 这个接口一个进程只要调用一次，最先调用
***********************************************************************************************************************/
int CRY_GetCipher(unsigned char *cipher_32byte, unsigned int serial_num);


/***********************************************************************************************************************
* 功  能: 初始化数据信息，将AES解密后得到的明文配置进来
* 参  数: plain_buffer    - I  输入明文地址
*         data_len        - I  密文长度，长度必须为32
* 返回值: 成功返回1，失败返回-1
* 备  注: 一个进行只调用一次，在调用CRY_GetCipher，并且得到AES明文后调用，调用完该接口后可以开始调用进程内所有算法库创建
***********************************************************************************************************************/
int CRY_SetDataInfo(unsigned char *plain_buffer, int data_len);



#ifdef __cplusplus
}
#endif

#endif