/**
 * @file   sal_mem_stats.c
 * @note   2010-2020, Hikvision Digital Technology Co., Ltd.
 * @brief   OS内存申请模块，内存申请及释放时会进行统计功能。
 * @author  yeyanzhong
 * @date    2021.5.20
 * @note
 * @note \n History
   1.Date        :
     Author      :
     Modification:
 */


#ifndef _SAL_MEM_NEW_H_
#define _SAL_MEM_NEW_H_

/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */
#include "sal_type.h"
/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数定义区                                        */
/* ========================================================================== */

/*******************************************************************************
* 函数名  : SAL_memAlloc
* 描  述  : 该函数负责在linux用户态中申请内存
* 输  入  : - size:  要申请的内存大小
*           - szModName 模块名字，不能为空，必须输入
*           - szMemName 内存名字，不能为空，必须输入
* 输  出  : 无。
* 返回值  : 非NULL: 申请成功
*           NULL:   申请失败
*******************************************************************************/
Ptr SAL_memMalloc(UINT32 size, CHAR *szModName, CHAR *szMemName);

/*******************************************************************************
* 函数名  : SAL_memZalloc
* 描  述  : 该函数在SAL_memUAllocAlign的基础上,增加对内存清0的动作
* 输  入  : - size:  要申请的内存大小
* 输  出  : 无。
* 返回值  : 非NULL:  申请成功
*           NULL:    申请失败
*******************************************************************************/
Ptr SAL_memZalloc(UINT32 size, CHAR *szModName, CHAR *szMemName);


/*******************************************************************************
* 函数名  : SAL_memFree
* 描  述  : 系统抽象层下的内存申请封装函数，负责负责释放内存并统计更新当前系统总计使用的内存
* 输  入  : - pPtr:    要释放的内存地址
* 输  出  : 无
* 返回值  : SAL_SOK:   成功,内存已释放
*           SAL_FAIL: 失败, 内存未释放
*******************************************************************************/
INT32 SAL_memfree(Ptr pPtr, CHAR *szModName, CHAR *szMemName);

/*******************************************************************************
* 函数名  : SAL_memPageSize
* 描  述  : 获取系统页大大小
* 输  入  : - void:
* 输  出  : 无
* 返回值  : 页大小
*******************************************************************************/
UINT32 SAL_memPageSize(void);

/*******************************************************************************
* 函数名  : SAL_memAlign
* 描  述  : 系统抽象层下的内存申请封装函数，负责申请内存并统计下来，能够保证申请的内存有字节对齐的效果
* 输  入  : - alignSize: 强制字节对齐的长度
*         : - size     : 申请大小
* 输  出  : 无
* 返回值  : ptr  : 申请成功的内存地址
*           NULL : 申请失败
*******************************************************************************/
void *SAL_memAlign(UINT32 alignSize, UINT32 size, CHAR *szModName, CHAR *szMemName);


/*******************************************************************************
* 函数名  : SAL_memArray2D
* 描  述  : 给二维数组申请内存
* 输  入  : - row: 行
*         : - col: 列
* 输  出  : 无
* 返回值  : 二维数组内存
*******************************************************************************/
UINT32** SAL_memArray2D(UINT32 row, UINT32 col, CHAR *szModName, CHAR *szMemName);

/*******************************************************************************
* Function      : SAL_memCpy
* Description   : 封装 memcpy 函数，进行四字节对齐式的快速拷贝
* Input         : - dest  : 目标地址
*               : - src   : 源
*               : - nBytes: 长度
* Output        : NONE
* Return        : HIK_SOK  : Success
*                 HIK_FAIL : Fail
*******************************************************************************/
void SAL_memCpy(INT8 *dest, INT8 *src, UINT32 nBytes);

#endif  /*  _SAL_MEM_H_  */

