/**
* @file  fpga_drv.h
* @note  2001-2012, 杭州海康威视数字技术股份有限公司
* @brief  fpga配置头文件

* @author  wutao19
* @date    2019/01/09

* @note :
* @note \n History:
  1.日    期: 2019/01/09
    作    者: wutao19
    修改历史: 创建文件
*/
#ifndef _DSP_FPGA_H_
#define _DSP_FPGA_H_

/*----------------------------------------------*/
/*                 包含头文件                   */
/*----------------------------------------------*/
#include "sal_type.h"
#include "sal.h"


/*******************************************************************************
* 函数名  : Fpga_SetResolution
* 描  述  : 写fpga寄存器的值
* 输  入  : UINT32 u32Reg : 寄存器地址
* 输  出  : UINT32 u32Val : 值
* 返回值  : 
*******************************************************************************/
INT32 Fpga_SetResolution(UINT32 u32Chn, UINT32 u32Width, UINT32 u32Height, UINT32 u32Fps);

/*******************************************************************************
* 函数名  : Fpga_Reset
* 描  述  : 检测FPGA统计的宽高并复位
* 输  入  : 
* 输  出  : 
* 返回值  : 
*******************************************************************************/
INT32 Fpga_Reset(UINT32 u32Chn);

/*******************************************************************************
* 函数名  : Fpga_Init
* 描  述  : 初始化FPGA
* 输  入  : 
* 输  出  : 
* 返回值  : 
*******************************************************************************/
INT32 Fpga_Init(UINT32 u32Chn);

/*******************************************************************************
* 函数名  : Fpga_GetBuildTime
* 描  述  : 获取固件编译时间
* 输  入  : UINT32 u32Chn
            
* 输  出  : 
* 返回值  : SAL_SOK : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 Fpga_GetBuildTime(UINT32 u32Chn, UINT8 *pu8Buff, UINT32 u32Len);

/*******************************************************************************
* 函数名  : Fpga_Scale
* 描  述  : 对输入分辨率做相应缩放
* 输  入  : VIDEO_RES_S *pstDst
            VIDEO_RES_S *pstSrc
* 输  出  : 
* 返回值  : SAL_SOK : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 Fpga_Scale(VIDEO_RES_S *pstDst, VIDEO_RES_S *pstSrc);

#endif

