 /**********************************************************************************************************************************
 *
 * 版权信息：版权所有 (c) 2021, 杭州海康威数字技术股份有限公司, 保留所有权利
 *
 * 文件名称：ini.h
 * 摘    要：libXRay算法库读取ini配置文件
 *
 * 当前版本：V 1.0
 * 作    者：王天舒
 * 日    期：2022年06月14日
 * 备    注：
 ***********************************************************************************************************************************/

#ifndef INI_H
#define INI_H

/* ini example */
/*****************
[section1]
key1 = 1280
key2 = Xray Solution
;分号标注注释行
[section2]
key1 = 128
key2 = 10.1.74.229
;分号标注注释行
******************/

/* ini index example */
/*****************
[section1]
1/key1 = 1280
1/key2 = Xray Solution
2/key1 = 128
2/key2 = 10.1.74.229
;分号标注注释行
******************/

#ifdef __cplusplus
extern "C" {
#endif
#define INI_VERSION "0.1.1"

typedef struct ini_t ini_t;
#define INI_SGET_SUCCESS 1
#define INI_SGET_FAILURE 0
#define INI_MAX_KEY_LEN  1024

/***************************************************************************************************
* 函数名：ini_load
* 功  能：载入ini文件到结构体
* 参  数：
*        filename               - I          ini文件路径
*
* 返回值：ini结构体指针
***************************************************************************************************/
ini_t*      ini_load(const char *filename);

/***************************************************************************************************
* 函数名：ini_free
* 功  能：释放ini结构体内部内存
* 参  数：
*        ini                    - I          ini结构体指针
*
* 返回值：void
***************************************************************************************************/
void        ini_free(ini_t *ini);

/***************************************************************************************************
* 函数名：ini_get
* 功  能：读取ini配置文件
* 参  数：
*        ini                    - I          ini结构体指针
*        section                - I          section字符串
*        key                    - I          key字符串
*
* 返回值：获取键值对应的字符串
***************************************************************************************************/
const char* ini_get(ini_t *ini, const char *section, const char *key);

/***************************************************************************************************
* 函数名：ini_sget
* 功  能：读取ini配置文件
* 参  数：
*        ini                    - I          ini结构体指针
*        section                - I          section字符串
*        key                    - I          key字符串
*        scanfmt                - I          读取方式(NULL/字符串读取；"%d"/整型读取，其他format参考sscanf函数)
*        dst                    - O          获取键值地址
*
* 返回值：int (INI_SGET_SUCCESS / INI_SGET_FAILURE)
***************************************************************************************************/
int         ini_sget(ini_t *ini, const char *section, const char *key, const char *scanfmt, void *dst);

/***************************************************************************************************
* 函数名：ini_sget_index
* 功  能：读取ini配置文件
* 参  数：
*        ini                    - I          ini结构体指针
*        section                - I          section字符串
*        key                    - I          key字符串
*        scanfmt                - I          读取方式(NULL/字符串读取；"%d"/整型读取，其他format参考sscanf函数)
*        idx                    - I          索引
*        dst                    - O          获取键值地址
*
* 返回值：int (INI_SGET_SUCCESS / INI_SGET_FAILURE)
***************************************************************************************************/
int         ini_sget_index(ini_t *ini, const char *section, const char *key, const char *scanfmt, int idx, void *dst);

#ifdef __cplusplus
}
#endif 
#endif
