/***************************************************************************************************
* 
* 版权信息：版权所有 (c) 2015, 杭州海康威视软件有限公司, 保留所有权利
*
* 文件名称：hka_core.h
* 摘    要：hka基础函数
* 
* 当前版本：1.0.0
* 作    者：武晓阳
* 日    期：2015年5月20日
* 备    注：创建并完成草稿
***************************************************************************************************/
#ifndef _HKA_CORE_H_
#define _HKA_CORE_H_


#include "hka_types.h"


#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************************************
* 功  能：按照对齐分配内存
* 参  数：*
*         size        -I    所需分配的内存大小
*         align       -I    对齐的字节数，需要为2的幂次方
* 返回值：所分配内存指针
* 备  注：HKA_Malloc与HKA_Free配套使用
***************************************************************************************************/
HKA_VOID* JPGD_HKA_Malloc(HKA_SZT size, 
                          HKA_S32 align);

/***************************************************************************************************
* 功  能：释放对齐申请的内存
* 参  数：*
*         buf        -I    内存指针
* 返回值：无
* 备  注：HKA_Malloc与HKA_Free配套使用
*         释放后没有将指针赋值为HKA_NULL
***************************************************************************************************/
HKA_VOID JPGD_HKA_Free(HKA_VOID *buf);

/***************************************************************************************************
* 功  能：申请HKA_MEM_TAB内存
* 参  数：*
*         mem_tab        -I/O    内存块列表
*         tab_num        -I      内存块数量
* 返回值：状态码
* 备  注：
***************************************************************************************************/
HKA_STATUS JPGD_HKA_AllocMemTab(HKA_MEM_TAB       *mem_tab, 
                                HKA_S32            tab_num);

/***************************************************************************************************
* 功  能：释放HKA_MEM_TAB内存
* 参  数：*
*         mem_tab        -I/O    内存块列表
*         tab_num        -I      内存块数量
* 返回值：状态码
* 备  注：
***************************************************************************************************/
HKA_STATUS JPGD_HKA_FreeMemTab(HKA_MEM_TAB *mem_tab, HKA_S32 tab_num);

/***************************************************************************************************
* 功  能：检测HKA_MEM_TAB参数是否正确
* 参  数：*
*         mem_tab     -I    待检测的内存块列表
*         tab_num     -I    内存块列表数量
*         align       -I    内存块对齐要求
* 返回值：状态码
* 备  注：
***************************************************************************************************/
HKA_STATUS JPGD_HKA_CheckMemTab(HKA_MEM_TAB       *mem_tab, 
                                HKA_S32            tab_num,
                                HKA_MEM_ALIGNMENT  align);

/***************************************************************************************************
* 功  能：检测图像结构体是否正确
* 参  数：*
*         img   -I  图像结构体地址         
* 返回值：状态码
* 备  注：
***************************************************************************************************/
HKA_STATUS JPGD_HKA_CheckImage(HKA_IMAGE *img);

/***************************************************************************************************
* 函数名：HKA_GetCpuClocks
* 功  能：读取时间寄存器计数, time stamp counter (TSC)
* 参  数：
* 返回值：寄存器读数
* 备  注：
***************************************************************************************************/
HKA_U64 JPGD_HKA_GetCpuClocks();

#ifdef __cplusplus
}
#endif 

#endif //_HKA_CORE_H_


