/**
 * @file   face_out.h
 * @note   2020-2030, 杭州海康威视数字技术股份有限公司
 * @brief  人脸模块外部头文件
 * @author sunzelin
 * @date   2022/8/22
 * @note
 * @note \n History
   1.日    期: 2022/8/22
     作    者: sunzelin
     修改历史: 创建文件
 */
#ifndef __FACE_OUT_H__
#define __FACE_OUT_H__

/*----------------------------------------------*/
/*                 包含头文件                   */
/*----------------------------------------------*/
#include "sal.h"
#include "ia_common.h"

/*----------------------------------------------*/
/*                 宏类型定义                   */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                结构体定义                    */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                 函数声明                     */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                 全局变量                     */
/*----------------------------------------------*/

/*----------------------------------------------*/
/*                 函数定义                     */
/*----------------------------------------------*/

/**
 * @function   Face_tskInit
 * @brief      人脸模块tsk层初始化
 * @param[in]  void
 * @param[out] None
 * @return     INT32
 */
INT32 Face_tskInit(void);

/**
 * @function   CmdProc_faceCmdProc
 * @brief      应用层命令字交互接口
 * @param[in]  HOST_CMD cmd
 * @param[in]  UINT32 chan
 * @param[in]  void *prm
 * @param[out] None
 * @return     INT32
 */
INT32 CmdProc_faceCmdProc(HOST_CMD cmd, UINT32 chan, void *prm);

#endif

