/*******************************************************************************
* vda_hal_drv.h
*
* HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
*
* Author : wangweiqin <wangweiqin@hikvision.com.cn>
* Version: V1.0.0  2017年11月10日 Create
*
* Description : 硬件平台移动侦测模块
* Modification:
*******************************************************************************/
#ifndef _VDA_HAL_DRV_H_
#define _VDA_HAL_DRV_H_

/*****************************************************************************
                                头文件
*****************************************************************************/
#include "sal.h"
#include "platform_sdk.h"
#include <sys/ioctl.h>
//

/*****************************************************************************
                                宏定义
*****************************************************************************/

#define MAX_VDA_CHN_NUM     (2)
#define IVE_MD_IMAGE_NUM    (2)

#define MAX_MD_WIDTH     (704)
#define MAX_MD_HEIGHT    (576)

#define MD_V_SIZE        (18)
#define MD_H_SIZE        (22)

#define IVE_ALIGN        (16)

/*****************************************************************************
                                结构体定义
*****************************************************************************/
	
typedef struct _IMAGE_RECT_
{
	UINT32 x;	  //矩形左上角X轴坐标
	UINT32 y;	  //矩形左上角Y轴坐标
	UINT32 width;  //矩形宽度
	UINT32 height; //矩形高度
}IMAGE_RECT;

/* 模块 属性 */
typedef struct tagVdaHalChnPrmSt
{
    UINT32 uiChn;                /* 通道号 */
    UINT32 uiLevel;              /* 灵敏度等级 */
	UINT32 curIndx;              /* 当前帧号 */
	IMAGE_RECT rec;              /* 检测结果区域 */
	UINT32 mask[MD_V_SIZE]; 
    /* */
    IVE_SRC_IMAGE_S    astImg[IVE_MD_IMAGE_NUM];  /* 移动侦测参考图像 */
    IVE_DST_MEM_INFO_S stBlob;
    IVE_DST_IMAGE_S    stIveDstImage;
}VDA_HAL_CHN_PRM;


/* 模块 属性 */
typedef struct tagVdaModHalPrmSt
{
    UINT32 uiChnNum;                /* 已创建的通道个数 */
    VDA_HAL_CHN_PRM stVdaHalChnPrm[MAX_VDA_CHN_NUM]; /* 每个通道的信息 */
}VDA_MOD_HAL_PRM;
    

/*****************************************************************************
                            函数声明
*****************************************************************************/
/*****************************************************************************
 函 数 名  : Vda_halIVEProc
 功能描述  : IVE 处理
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halIVEProc(UINT32 uiChn, UINT32 curIndx,UINT32 *pstResult, UINT32 *puiMoved);

/*****************************************************************************
 函 数 名  : Vda_halIVEDmaImage
 功能描述  : DMA 帧信息到 ive 图片
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halIVEDmaImage(UINT32 uiChn, VOID *pFrame, UINT32 index);

/*****************************************************************************
 函 数 名  : Vda_halMdChnSetLevel
 功能描述  : 移动侦测 灵敏度
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halMdChnSetLevel(UINT32 uiChn, UINT32 uiLevel);

/*****************************************************************************
 函 数 名  : Vda_halMdChnCreate
 功能描述  : 移动侦测通道创建
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halMdChnCreate(UINT32 uiChn);

/*****************************************************************************
 函 数 名  : Vda_halMdInit
 功能描述  : 移动侦测模块初始化
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halMdInit(void);


/*****************************************************************************
 函 数 名  : Vda_halMdChnSetReg
 功能描述  : 移动侦测 检测区域
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halMdChnSetReg(UINT32 uiChn, UINT32 *RegMask);


/*****************************************************************************
 函 数 名  : Vda_halMdChnSetLevel
 功能描述  : 移动侦测 灵敏度
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
 调用函数  :
 被调函数  :

 修改历史      :
  1.日    期   : 2017年11月11日
    作    者   : wwq
    修改内容   : 新生成函数
*****************************************************************************/
INT32 Vda_halMdChnSetLevel(UINT32 uiChn, UINT32 uiLevel);

INT32 Vda_halGetExtFrmaeInfo(SYSTEM_FRAME_INFO  *pstSysFrameInfo);

#endif /* _VDA_HAL_DRV_H_*/

