
/*******************************************************************************
 * ch7053_drv.h
 *
 * HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
 *
 * Author : cuifeng5
 * Version: V1.0.0  2021年06月07日 Create
 *
 * Description : ch7053配置相关
 * Modification: 
 *******************************************************************************/

#ifndef __CH7053_DRV_H_
#define __CH7053_DRV_H_

/*******************************************************************************
* 函数名  : CH7053_Init
* 描  述  : ch7053初始化
* 输  入  : 
* 输  出  : 
* 返回值  : SAL_SOK : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 CH7053_Init(UINT32 u32Chn);

/*******************************************************************************
* 函数名  : CH7053_Reset
* 描  述  : 复位ch7053
* 输  入  : 
* 输  出  : 
* 返回值  : SAL_SOK : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 CH7053_Reset(UINT32 u32Chn);

/*******************************************************************************
* 函数名  : CH7053_Set
* 描  述  : 配置ch7053
* 输  入  : 
* 输  出  : 
* 返回值  : SAL_SOK : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 CH7053_Set(UINT32 u32Chn, UINT32 u32Width, UINT32 u32Height, UINT32 u32Fps);

/*******************************************************************************
* 函数名  : CH7053_SetResolution
* 描  述  : 设置ch7053分辨率
* 输  入  : 
* 输  出  : 
* 返回值  : SAL_SOK : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 CH7053_SetResolution(const BT_TIMING_S *pstTiming, UINT8 u8BusIdx, UINT8 u8ChipAddr, UINT32 u32Chn);


#endif

