/*******************************************************************************
* vgs_hal_api.h
*
* HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
*
* Author : wangweiqin <wangweiqin@hikvision.com.cn>
* Version: V1.0.0  2018年03月13日 Create
*
* Description : 硬件平台 vgs 模块
* Modification:
*******************************************************************************/
#ifndef _VGS_DRV_H_
#define _VGS_DRV_H_

/*****************************************************************************
                                头文件
*****************************************************************************/
#include <sal.h>
#include "capbility.h"


/*****************************************************************************
                                宏定义
*****************************************************************************/

/*****************************************************************************
                                结构体定义
*****************************************************************************/



/*****************************************************************************
                            函数声明
*****************************************************************************/

/*******************************************************************************
* 函数名  : vgs_drv_drawLineSoftInit
* 描  述  :
* 输  入  : 
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 vgs_func_drawLineSoftInit(VGS_DRAW_AI_PRM **ppstPrm);

/*****************************************************************************
   函 数 名  : vgs_drv_drawRectArraySoft
   功能描述  : 使用 软件画线
   输入参数  : stTask vgs缩放任务参数
   输出参数  : 无
   返 回 值  : 成功SAL_SOK
                         失败SAL_FAIL
*****************************************************************************/
INT32 vgs_func_drawRectArraySoft(SAL_VideoFrameBuf *pstSalFrame, VGS_RECT_ARRAY_S *pstRectArray, BOOL bNeedMmap, BOOL bSnap);

/*******************************************************************************
* 函数名  : vgs_drv_drawLineSoft
* 描  述  : 使用CPU进行垂直画线
* 输  入  : - stTask	 : 帧数据
*		  : - pstLinePrm : 画线数据
*		  : - needMmap	 : 是否需要对地址进行map
*		  : - ailinetype : 画线类型
* 输  出  : - stTask	 : 帧数据
* 返回值  : SAL_SOK  : 成功
*			SAL_FAIL : 失败
*******************************************************************************/
INT32 vgs_func_drawLineSoft(SAL_VideoFrameBuf *pstSalFrame, VGS_DRAW_LINE_PRM *pstLinePrm, UINT32 needMmap, BOOL bSnap);



#endif /* _VGS_HAL_H_*/

