/***********************************************************************************************************************
* 版权信息：版权所有 (c) 2010, 杭州海康威视软件有限公司, 保留所有权利
* 
* 文件名称：alc_lib.h
* 文件标识：ALC_LIB_H
* 摘    要：音量调整算法库
*
* 版    本：1.2.4
* 作    者：王旻31
* 日    期：2020.7.13
* 备    注：1、增加了对采样率的检查，仅支持8k/16k/22.05k/32k/44.1k/48k
*           2、修改了接口中的错误码
*
* 版    本：1.2.3
* 作    者：周瑞煊
* 日    期：2019.4.1
* 备    注：增加强制音量设置功能
*
* 版    本：1.2.1
* 作    者：周瑞煊
* 日    期：2018.10.10
* 备    注：增加对64采样点帧长的支持
*
* 版    本：1.2.0
* 作    者：陈展
* 日    期：2017.07.20
* 备    注：解决大帧长时候 原先20大小只能到20*128=2560帧长，以上就全部内存越界了BUG
*
* 版    本：1.1.0
* 作    者：陈展
* 日    期：2017.03.24
* 备    注：采用新接口和头文件

* 版    本：1.0.3
* 作    者：胡林艳
* 日    期：2015.11.11
* 备    注：修改接口中帧长限制不一致的bug
*
* 版    本：1.0.2
* 作    者：胡林艳
* 日    期：2015.4.28
* 备    注：修改冲突定义
*
* 版    本：1.0.1
* 作    者：胡林艳
* 日    期：2015.4.28
* 备    注：原始版本
*
* 版    本：1.0.0
* 作    者：陈扬坤
* 日    期：2013.5.27
* 备    注：原始版本
*
***********************************************************************************************************************/
#ifndef _HIK_ALC_LIB_H_
#define _HIK_ALC_LIB_H_

//支持采样率与对应帧长
//采样率：8k,16k,22.05k,32k,44.1k,48k
//帧长：[64,4096]short

#ifdef __cplusplus
extern "C" {
#endif 

#include "apa_common.h"

/***********************************************************************************************************************
*文件版本和时间宏声明
***********************************************************************************************************************/
/* 当前版本号*/
/* 主版本号，接口改动、功能增加、架构变更时递增，最大63 */
#define     HIK_ALC_MAJOR_VERSION              1
/* 子版本号，性能优化、局部结构调整、模块内集成其他库的主版本提升时递增，最大31 */
#define     HIK_ALC_SUB_VERSION                2
/* 修正版本号，修正bug后递增，最大31 */
#define     HIK_ALC_REVISION_VERSION           4
/* 版本日期*/
#define     HIK_ALC_VER_YEAR                   20           /* 年*/
#define     HIK_ALC_VER_MONTH                   7           /* 月*/
#define     HIK_ALC_VER_DAY                    13           /* 日*/


//参数配置索引
typedef enum _ALC_CFG_ENUM_KEY_PARAM_
{
    ALC_CFG_PARAM_START             = 0,    /* 配置起始索引号                                   */
    ALC_CFG_PARAM_VOLUME_ADJUST     = 1,    /* 音量调整索引，1-100,默认50                       */
    ALC_CFG_PARAM_VOLUME_SET_OPEN   = 2,    /* 音量设置索引开启                                 */
    ALC_CFG_PARAM_VOLUME_SET        = 3,    /* 音量设置索引，1-100,默认50                       */
    ALC_CFG_PARAM_END                       /* 配置结束索引号                                   */
}ALC_CFG_ENUM_KEY_PARAM;

/***********************************************************************************************************************
* 功  能: 获取内存大小
* 参  数: param                  - I 输入参数，帧长在[80 4096]
*         mem_tab                - O 内存申请表
* 返回值: 状态码
***********************************************************************************************************************/
HRESULT HIK_ALC_GetMemSize(APA_AUDIO_INFO *param,
                           APA_MEM_TAB    *mem_tab);

/***********************************************************************************************************************
* 功  能: 创建算法库
* 参  数: param                  - I   输入参数,帧长在[80 4096]
*         mem_tab                - I   内存申请表
*         handle                 - I/O VA模块句柄
* 返回值: 状态码
***********************************************************************************************************************/
HRESULT HIK_ALC_Create(APA_AUDIO_INFO *param, 
                       APA_MEM_TAB    *mem_tab, 
                       void           **handle);
							
/***********************************************************************************************************************
* 功  能: 库主处理函数
* 参  数: handle                 - I/O 库句柄
*         in_buf                 - I   算法库输入
*         in_buf_size            - I   输入缓存大小,帧长在[80 4096]
*         out_buf                - O   音量调整后输出缓存
*         out_buf_size           - I   输出缓存大小,以BYTE计算
* 返回值: 状态码
***********************************************************************************************************************/
HRESULT HIK_ALC_Process(void                *handle,
					    void                *in_buf,
                        int                  in_buf_size,
                        void                *out_buf,
                        int                  out_buf_size);
							 
/***********************************************************************************************************************
* 功  能: 参数配置
* 参  数: handle                 - I/O VA模块句柄
*         config_type            - I   配置类型，VCA_SET_CFG_SINGLE_PARAM
*         config_buf             - I/O 外部输入配置信息的指针,参照APA_KEY_PARAM结构体
*         buf_size               - I   config_buf大小
* 返回值: 状态码
***********************************************************************************************************************/
HRESULT HIK_ALC_SetConfig(void  *handle,
                          int   config_type,
                          void *config_buf,
                          int   buf_size);

/***********************************************************************************************************************
* 功 能：获取参数
* 参 数：handle           -IO  返回VA模块句柄        
*        config_type      -I   配置类型，APA_GET_CFG_SINGLE_PARAM
*        config_buf       -I   外部输入配置信息的指针,参照APA_KEY_PARAM结构体
*        buf_size         -I   config_buf大小
* 返回值：HRESUTL;
***********************************************************************************************************************/
HRESULT HIK_ALC_GetConfig(void *handle,
                          int   config_type,
                          void *config_buf,
                          int   buf_size);

#ifdef __cplusplus
}
#endif 



#endif