/*******************************************************************************
* vda_tsk.h
*
* HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
*
* Author : wutao19 <wutao19@hikvision.com.cn>
* Version: V1.0.0  2019年7月10日 Create
*
* Description : 硬件平台移动侦测模块
* Modification:
*******************************************************************************/
#ifndef _VDA_TSK_H_
#define _VDA_TSK_H_

/*****************************************************************************
                                头文件
*****************************************************************************/
#include "sal.h"
#include "platform_sdk.h"
#include <sys/ioctl.h>

#include "dspcommon.h"
#include "vda_drv.h"
/*****************************************************************************
                                宏定义
*****************************************************************************/


/*****************************************************************************
 函 数 名  : Vda_tskMdChnSet
 功能描述  : 移动侦测 参数
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
*****************************************************************************/
INT32 Host_VdaMdChnSet(UINT32 uiChn, VOID *pPrm);

/*****************************************************************************
 函 数 名  : Vda_tskMdChnStop
 功能描述  : 移动侦测通道结束
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
*****************************************************************************/
INT32 Host_VdaMdChnStop(UINT32 uiChn);

/*****************************************************************************
 函 数 名  : Vda_tskMdChnStart
 功能描述  : 移动侦测通道开始
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 无
*****************************************************************************/
INT32 Host_VdaMdChnStart(UINT32 uiChn);



#endif 


