#ifndef xtrans_THR_H_
#define xtrans_THR_H_


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */

/* 使用默认大小的堆栈 */
#define XTRANS_THR_STACK_SIZE_DEFAULT 0

/*
* 调度策略枚举定义，调度策略只对linux用户态和内核态线程有效，
* 该枚举在SYSBIOS中无效。
*/
typedef enum
{
    xtrans_SCHED_OTHER  = 0,  /* 分时调度策略 */
    xtrans_SCHED_FIFO,        /* 实时调度策略，先到先服务。*/
    xtrans_SCHED_RR,          /* 实时调度策略，时间片轮转。*/
    xtrans_SCHED_NUM,
} xtrans_thrSchedPolicy;


/* 线程句柄，所有操作均基于此句柄。*/
typedef HPR_HANDLE xtrans_ThrHandle;


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */

/* 创建线程所需要的信息。*/
typedef struct
{
    HPR_INT32 (*OpThrRun)(Ptr pUsrArgs); /* 线程运行函数 */

    HPR_UINT16 thrPol;      /* 调度策略，其定义见xtrans_thrSchedPolicy */
    HPR_UINT16 thrPri;      /* 调度优先级 */

    /*
    栈大小，XTRANS_THR_STACK_SIZE_DEFAULT表示默认栈大小，如果为默认大小，
    则pStackAddr不起作用
    */
    HPR_UINT32 stackSize;
    Ptr    pStackAddr;  /* 栈起始地址，Linux内核态中无效，不使用时请设为NULL。*/

    Ptr    pUsrArgs;    /* 用户自定义参数 */

    HPR_UINT32 reserved[4];
} xtrans_ThrCreate;

#ifdef __cplusplus
extern "C" {
#endif


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */

/*******************************************************************************
* 函数名  : xtrans_thrCreate
* 描  述  : 创建线程。
* 输  入  : - pCreate: 创建参数。
*           - phThr  : 返回的句柄。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrCreate(xtrans_ThrCreate *pCreate,
                    xtrans_ThrHandle *phThr);


/*******************************************************************************
* 函数名  : xtrans_thrDelete
* 描  述  : 删除线程。
* 输  入  : - hThr: 线程句柄。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrDelete(xtrans_ThrHandle hThr);


/*******************************************************************************
* 函数名  : xtrans_thrShouldStop
* 描  述  : 判断线程是否需要退出, 在线程执行函数中调用。
* 输  入  : 无。
* 输  出  : 无。
* 返回值  : HPR_OK  : 校验成功。
*           HPR_ERROR: 校验失败。
*******************************************************************************/
HPR_INT32 xtrans_thrShouldStop(void);


/*******************************************************************************
* 函数名  : xtrans_thrDelete
* 描  述  : 删除线程。
* 输  入  : - hThr: 线程句柄。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrJoin(xtrans_ThrHandle hThr);


/*******************************************************************************
* 函数名  : xtrans_thrChangePri
* 描  述  : 修改线程优先级。
* 输  入  : - hThr  : 线程句柄。
            - thrPri: 线程优先级。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrChangePri(xtrans_ThrHandle hThr, HPR_UINT32 thrPri);


/*******************************************************************************
* 函数名  : xtrans_thrGetMaxPri
* 描  述  : 获取最大优先级值。
* 输  入  : - thrPol: 线程调度策略，其定义见xtrans_thrSchedPolicy。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrGetMaxPri(HPR_UINT32 thrPol);

/*******************************************************************************
* 函数名  : xtrans_thrGetMinPri
* 描  述  : 获取最小优先级值。
* 输  入  : - thrPol: 线程调度策略，其定义见xtrans_thrSchedPolicy。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrGetMinPri(HPR_UINT32 thrPol);


/*******************************************************************************
* 函数名  : xtrans_thrExit
* 描  述  : 主动退出线程。
* 输  入  : - pRetVal: 退出后返回的值。
* 输  出  : 无。
* 返回值  : HPR_OK  : 成功。
*           HPR_ERROR: 失败。
*******************************************************************************/
HPR_INT32 xtrans_thrExit(Ptr pRetVal);


/*******************************************************************************
* 函数名  : xtrans_thrGetTid
* 描  述  : 获取线程号。
* 输  入  : 无。
* 输  出  : 无。
* 返回值  : 线程号。
*******************************************************************************/
HPR_INT32 xtrans_thrGetTid(void);


/*******************************************************************************
* 函数名  : xtrans_thrGetPid
* 描  述  : 获取进程号。
* 输  入  : 无。
* 输  出  : 无。
* 返回值  : 进程号。
*******************************************************************************/
HPR_INT32 xtrans_thrGetPid(void);

/*******************************************************************************
* 函数名  : xtrans_thrGetName
* 描  述  : 获取进程名称, 仅内核态下有效，用户态和sys bios下返回NULL。
* 输  入  : 无。
* 输  出  : 无。
* 返回值  : 进程名字。
*******************************************************************************/
char *xtrans_thrGetName(void);


/* 最大优先级值 */
#define xtrans_THR_PRI_MAX(thrPol)    xtrans_thrGetMaxPri(thrPol)

/* 最小优先级值 */
#define xtrans_THR_PRI_MIN(thrPol)    xtrans_thrGetMinPri(thrPol)

/* 默认先级值，为中间值。*/
#define xtrans_THR_PRI_DEFAULT(thrPol)         \
                (xtrans_THR_PRI_MIN(thrPol) + \
                (xtrans_THR_PRI_MAX(thrPol)   \
                    - xtrans_THR_PRI_MIN(thrPol)) / 2)

/**--------------------------------------------------------------------------------------------------------------------@n
 \brief 创建线程等待命令句柄

 \parma [out] phHnd 指向创建的设备句柄
 
 \return HPR_OK 成功
 \return HPR_ERROR 失败
 
----------------------------------------------------------------------------------------------------------------------*/
HPR_INT32 xtrans_thrWaitCreate(HPR_HANDLE *phHnd);

/**--------------------------------------------------------------------------------------------------------------------@n
 \brief 销毁线程等待命令句柄

 \parma [in] hHnd 销毁的命令句柄
 
 \return HPR_OK 成功
 \return HPR_ERROR 失败
 
----------------------------------------------------------------------------------------------------------------------*/
HPR_INT32 xtrans_thrWaitDestroy(HPR_HANDLE hHnd);

/**--------------------------------------------------------------------------------------------------------------------@n
 \brief 线程等待命令

 \parma [in] hHnd 命令句柄
 \parma [in] puInCmd 等待的入口命令值
 \parma [in] pu8OutCmd 等待的出口命令值
 
 \return HPR_OK 成功
 \return HPR_ERROR 失败
 
----------------------------------------------------------------------------------------------------------------------*/
HPR_INT32 xtrans_thrWaitCmd(HPR_HANDLE hHnd, HPR_UINT8 *pu8InCmd, HPR_UINT8 *pu8OutCmd);

/**--------------------------------------------------------------------------------------------------------------------@n
 \brief 唤醒线程

 \parma [in] hHnd 命令句柄
 \parma [in] puInCmd 等待的入口命令值
 \parma [in] pu8OutCmd 等待的出口命令值
 
 \return HPR_OK 成功
 \return HPR_ERROR 失败
 
----------------------------------------------------------------------------------------------------------------------*/
HPR_INT32 xtrans_thrAwakeCmd(HPR_HANDLE hHnd, HPR_UINT8 *pu8InCmd, HPR_UINT8 *pu8OutCmd); 

#ifdef __cplusplus
}
#endif


#endif /* xtrans_THR_H_ */

