/***********************************************************************************************************************
*
* 版权信息：版权所有 (c), 杭州海康威视数字技术股份有限公司, 保留所有权利
*
* 文件名称：vca_analyzing_json.h
* 文件标识：VCA_ANALYZING_JSON_H
* 摘    要：JSON配置文件解析接口定义文件
*
* 当前版本：1.0
* 作    者：童超
* 日    期：2019-05-28
* 备    注：初始版本
***********************************************************************************************************************/

#ifndef _VCA_ANALYZING_JSON_H_
#define _VCA_ANALYZING_JSON_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "vca_config_json.h"
#include <stdio.h>

/***********************************************************************************************************************
* 功  能：从文件获取VCA_JSON_APP_CONFIG_INFO结构体信息
* 参  数：
*         json_file				-I json文件内容指针
*         app_config_info		-O 结构体键值
* 返回值：状态码
***********************************************************************************************************************/
int VCA_JSON_Analyzing_APP_Config(char *json_file, VCA_JSON_APP_CONFIG_INFO *app_config_info);

/***********************************************************************************************************************
* 功  能：从JSON文件中解析VCA_JSON_CONFIG_INFO结构体信息
* 参  数：
*         json_string			-I json文件内容指针
*         rule_config_info		-O 结构体指针
* 返回值：状态码
***********************************************************************************************************************/
int VCA_JSON_Analyzing_Rule_Config(char *json_file, VCA_JSON_CONFIG_INFO *rule_config_info);

#ifdef __cplusplus
}
#endif

#endif